import { Component } from '@angular/core';

@Component({
  selector: 'app-questions-answers',
  imports: [],
  templateUrl: './questions-answers.component.html',
  styleUrl: './questions-answers.component.scss'
})
export class QuestionsAnswersComponent {
 selectedIndex: number | null = 0;

 faqs = [
  {
    question: "יש לי כבר אתר, למה להחליף אותו?",
    answer: `1. כמו שלא נוסעים היום ברכב מלפני 20 שנה – גם אתר צריך עדכון. אתרים ישנים לרוב לא מותאמים לניידים, איטיים, לא מאובטחים, ולא משדרים מקצועיות.
<br>
2. ייתכן שהאתר שלך לא ממיר גולשים ללקוחות. אתר חדש שנבנה נכון, עם תכנון חכם, עיצוב מודרני ותוכן מדויק – יכול לשדרג משמעותית את כמות הפניות.
<br>
3. עבדתי עם בעלי עסקים שעברו אליי אחרי שנים עם אתר ישן – והיום הם מקבלים פי 3 יותר לידים. מוזמן לקבל המלצות.
<br>
4. שינוי יכול להיות לא נעים, אבל תחשוב כמה זה שווה כשהלקוחות שלך מתרשמים ומבינים שהם הגיעו למקום מקצועי.
<br>
5. אתר זה לא רק עיצוב – אני משלבת פיתוח חכם עם ממשק ניהול קל, קידום בגוגל, חיבור לוואטסאפ/CRM וכלים שעושים לך סדר בעסק.
<br>
6. בעידן הדיגיטלי – מי שלא מתעדכן, פשוט נעלם. אני כאן כדי לדאוג שהאתר שלך יהיה צעד אחד לפני כולם – לא צעד מאחור.
<br>
7. יש אתרים שנבנו בקוד סגור או בפלטפורמות ישנות שמקשות על כל שינוי קטן. אצלי תקבל קוד נקי, גמיש, והדרכה מלאה לתפעול עצמאי.`
  },
  {
    question: "אני עסק קטן, למה אני בכלל צריך אתר?",
    answer: `גם עסק קטן צריך נראות דיגיטלית. אתר פשוט ומדויק מייצר אמון, מסביר על השירותים שלך ונותן ללקוחות דרך ליצור קשר מיידית – אפילו כשאתה ישן.`
  },
  {
    question: "יש לי רק עמוד אינסטגרם/פייסבוק – זה לא מספיק?",
    answer: `רשתות חברתיות הן כלי נהדר – אבל אתה תלוי באלגוריתם ובשינויים של פייסבוק. אתר זה הבית שלך – הוא שלך לתמיד, והוא נותן מידע מדויק שמחזיר גולשים ויוצר לקוחות.`
  },
  {
    question: "כמה עולה לבנות אתר? זה נשמע יקר…",
    answer: `אני בונה אתרים במגוון תקציבים – בהתאם לצרכים שלך. לפעמים אפילו אתר קטן ומדויק שווה הרבה יותר מהשקעה בפרסום. יש לי פתרונות חכמים גם לעסקים בתחילת הדרך.`
  },
  {
    question: "איך אדע שהאתר שלי באמת יעבוד ויביא לקוחות?",
    answer: `כי אני לא רק מפתחת – אני מבינה עסקים. אני חושבת יחד איתך על המסר, קהל היעד, קריאות לפעולה, ויוצרת אתר שמוביל את הגולש בדיוק לפעולה שאתה רוצה.`
  },
  {
    question: "אני לא מבין בטכנולוגיה… איך אנהל אתר לבד?",
    answer: `אתה לא לבד – אני מלווה אותך גם אחרי העלייה לאוויר. תוכל לקבל אתר עם ממשק ניהול פשוט, כולל סרטון הסבר, ואפילו תמיכה טכנית בהמשך לפי הצורך.`
  },
  {
    question: "אני חושש שזה ייקח המון זמן ויתקע אותי...",
    answer: `התהליך אצלי מדויק, מהיר ויעיל. ברגע שיש תוכן ותמונות – אפשר להקים אתר תוך ימים. אני עובדת בשקיפות מלאה ומעדכנת אותך בכל שלב.`
  }
];



  toggle(index: number) {
    this.selectedIndex = this.selectedIndex === index ? null : index;
  }
}
